# ExportLinetypeTableIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeTableIterator Class
Members See Also
---
An iterator to a set of line type table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ExportLinetypeTableIterator : IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>>
```

Visual Basic
---
```text
Public Class ExportLinetypeTableIterator _
	Implements IEnumerator(Of KeyValuePair(Of ExportLinetypeKey, ExportLinetypeInfo))
```

Visual C++
---
```text
public ref class ExportLinetypeTableIterator : IEnumerator<KeyValuePair<ExportLinetypeKey^, ExportLinetypeInfo^>>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExportLinetypeTableIterator
# See Also
ExportLinetypeTableIterator Members
Autodesk.Revit.DB Namespace